Revit 2024 API
CurveLoop.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<Curve> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of Curve)
Visual C++
public:
virtual IEnumerator<Curve^>^ GetEnumerator()
Return Value
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace